{
  "backend/main.mo": "Motoko canister managing user profiles with access control, allowing users to read and update their own profile and legacy high-score operations.",
  "feature_evidence.json": "Feature evidence report mapping implemented frontend features to source files, components, and test IDs.",
  "frontend-file-summaries.txt": "Prewritten summaries describing the purpose of various frontend files including UI, game systems, and state management.",
  "frontend/index.css": "Tailwind CSS configuration defining light and dark theme variables and global styles.",
  "frontend/index.html": "Minimal HTML entry point mounting the React app and loading the main TypeScript module.",
  "frontend/src/App.tsx": "Main React app handling routing, theme, authentication, and switching between Garage and Race views.",
  "frontend/src/auth/LoginButton.tsx": "Login/logout button using Internet Identity with query cache clearing and error handling.",
  "frontend/src/auth/ProfileSetupModal.tsx": "Modal for first‑time players to create an initial user profile before entering the game.",
  "frontend/src/game/controls/useKeyboardDrivingControls.ts": "Hook mapping keyboard input to steering, braking, and boosting states.",
  "frontend/src/game/controls/useTiltSteering.ts": "Hook providing optional mobile tilt‑based steering via device orientation events.",
  "frontend/src/game/garage/carLibrary.ts": "Defines the CarVariant interface and a list of predefined car variants with colors and base speeds.",
  "frontend/src/game/garage/GarageView.tsx": "Renders the 3D garage view with car preview, car selection controls, and a start button.",
  "frontend/src/game/garage/useSelectedCar.ts": "Zustand store managing the selected car index with persistence and navigation helpers.",
  "frontend/src/game/persistence/useHighScore.ts": "Hook managing high score storage, syncing with backend when authenticated and using localStorage otherwise.",
  "frontend/src/game/RaceView.tsx": "Race screen rendering the 3D scene, HUD, and overlays with Escape‑key pause handling.",
  "frontend/src/game/scene/CameraRig.tsx": "Camera component that follows a target with shaking effects during boost or drift.",
  "frontend/src/game/scene/CarModel.tsx": "3D car model component using basic geometries, supporting accent colors and optional headlights.",
  "frontend/src/game/scene/effects/BoostTrails.tsx": "Displays animated glowing boost trails behind the car during boosting.",
  "frontend/src/game/scene/effects/RainEffect.tsx": "Particle-based rain system that updates droplet positions relative to the player.",
  "frontend/src/game/scene/Environment.tsx": "Sets up the sky, road, and side barriers using textures and basic meshes.",
  "frontend/src/game/scene/LightingRig.tsx": "Dynamic lighting system adjusting sun position and ambient light based on time of day.",
  "frontend/src/game/scene/pickups/Pickups.tsx": "Renders coin and nitro pickup objects with simple meshes and lights.",
  "frontend/src/game/scene/RaceScene.tsx": "Main race scene wiring physics, AI, environment, effects, and rendering player and rival cars.",
  "frontend/src/game/sim/constants.ts": "Defines physics, nitro, day-night, and scoring constants used throughout the simulation.",
  "frontend/src/game/sim/dayNight.ts": "Hook simulating day-night cycle over time and determining when it is night.",
  "frontend/src/game/sim/progress.ts": "Utility determining whether the player is in first or second place based on Z positions.",
  "frontend/src/game/sim/scoring.ts": "Zustand scoring store and hook that triggers race finish when reaching the finish distance.",
  "frontend/src/game/sim/useCarPhysics.ts": "Updates car position, steering, drifting, and grip each frame based on inputs, weather, and nitro boost.",
  "frontend/src/game/sim/useNitro.ts": "Manages nitro boost state with depletion, regeneration, and a Zustand store.",
  "frontend/src/game/sim/usePickups.ts": "Generates coins and nitro pickups and marks them collected when the player gets close.",
  "frontend/src/game/sim/useRaceTimer.ts": "Tracks race time in a Zustand store and increments it each frame.",
  "frontend/src/game/sim/useRivalAI.ts": "Moves a rival car forward with slight lateral oscillation.",
  "frontend/src/game/sim/useSpeedometer.ts": "Converts car speed to km/h for display.",
  "frontend/src/game/sim/weather.ts": "Randomly toggles raining state on a timer.",
  "frontend/src/game/state/gameState.ts": "Zustand store for game view and race state transitions.",
  "frontend/src/game/ui/ControlsHelp.tsx": "UI button and popup showing control instructions.",
  "frontend/src/game/ui/FinishOverlay.tsx": "Displays race results, handles high scores, and provides restart/garage actions.",
  "frontend/src/game/ui/HUD.tsx": "Renders in-race HUD including score, time, speed, nitro, and position.",
  "frontend/src/game/ui/PauseOverlay.tsx": "Pause screen with resume, restart, and garage options.",
  "frontend/src/game/ui/StartOverlay.tsx": "Start screen prompting the player to begin the race.",
  "frontend/src/hooks/useActor.ts": "Creates and caches a backend actor tied to identity and invalidates dependent queries on change.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides a React context and provider for managing Internet Identity authentication, exposing identity state, login/clear actions, and status flags using Dfinity AuthClient.",
  "frontend/src/hooks/useQueries.ts": "Defines React Query hooks to fetch and update the caller's user profile via an actor, with automatic cache invalidation.",
  "frontend/src/index.css": "Configures Tailwind base styles and CSS variables for themes, including light/dark color tokens and utility classes.",
  "frontend/src/main.tsx": "Bootstraps the React app, wrapping it with QueryClientProvider and InternetIdentityProvider.",
  "frontend/src/utils/urlParams.ts": "Utility helpers to read, store, persist, and clear URL and session parameters, including hash-based routing support.",
  "frontend/tailwind.config.js": "Tailwind configuration extending theme tokens, colors, fonts, animations, and enabling plugins for typography, container queries, and animations.",
  "project_state.json": "Tracks project metadata, features, issues, and required assets for a Unity-based arcade racing game prototype."
}