{
  "backend/main.mo": "Actor managing user profiles with access control, supporting fetch/save operations and score updates.",
  "backend/migration.mo": "Migration module passing through userProfiles without transforming data.",
  "feature_evidence.json": "Evidence report mapping features to related frontend files and components.",
  "frontend-file-summaries.txt": "JSON-style list of short summaries for all frontend source files.",
  "frontend/index.css": "Tailwind CSS setup defining custom theme variables for light and dark modes.",
  "frontend/index.html": "HTML entry point mounting the React app and loading main.tsx.",
  "frontend/src/App.tsx": "Root React app handling auth state, profile loading, routing, and view selection.",
  "frontend/src/auth/LoginButton.tsx": "Login/logout button using Internet Identity with query cache clearing.",
  "frontend/src/auth/ProfileSetupModal.tsx": "Profile creation modal sending initial user profile with optional fields encoded correctly.",
  "frontend/src/components/AppErrorBoundary.tsx": "React error boundary displaying a fatal error screen and allowing reload.",
  "frontend/src/components/AppFatalErrorScreen.tsx": "Full-screen fatal error UI with reload and logout options.",
  "frontend/src/game/controls/useKeyboardDrivingControls.ts": "Tracks keyboard input for steering, braking, and boosting, returning simple control state values.",
  "frontend/src/game/controls/useTiltSteering.ts": "Provides device-tilt steering input with an enable toggle and clamped tilt values.",
  "frontend/src/game/garage/carLibrary.ts": "Defines car variant data and exports a static list of available cars.",
  "frontend/src/game/garage/GarageView.tsx": "Renders the 3D garage scene with car preview, selection UI, and race start controls.",
  "frontend/src/game/garage/useSelectedCar.ts": "Zustand store managing selected car index with persistence and next/previous navigation.",
  "frontend/src/game/persistence/useHighScore.ts": "Manages high score storage, using backend profile if authenticated or localStorage otherwise.",
  "frontend/src/game/RaceView.tsx": "Race screen rendering the 3D scene, HUD, overlays, and pause handling.",
  "frontend/src/game/scene/CameraRig.tsx": "Smoothly follows a target with camera shake effects based on boosting or drifting.",
  "frontend/src/game/scene/CarModel.tsx": "Renders a simple car model with configurable colors and optional headlights.",
  "frontend/src/game/scene/effects/BoostTrails.tsx": "Displays animated glowing boost trails behind the car using mesh opacity changes.",
  "frontend/src/game/scene/effects/RainEffect.tsx": "Simulates falling rain particles repositioned around the player as they move.",
  "frontend/src/game/scene/Environment.tsx": "Renders road, sky backdrop, and side barriers using repeating textures.",
  "frontend/src/game/scene/LightingRig.tsx": "Adjusts directional and ambient lighting based on time-of-day progression.",
  "frontend/src/game/scene/pickups/Pickups.tsx": "Renders coin and nitro pickup objects with lighting based on simulation data.",
  "frontend/src/game/scene/RaceScene.tsx": "Main race scene combining physics, AI, visuals, effects, and camera behavior.",
  "frontend/src/game/sim/constants.ts": "Defines physics, nitro, day-night, and scoring constants used throughout the simulation.",
  "frontend/src/game/sim/dayNight.ts": "Updates time-of-day progression and determines whether the scene is in night mode.",
  "frontend/src/game/sim/progress.ts": "Exports a helper to determine race position based on Z coordinates.",
  "frontend/src/game/sim/scoring.ts": "Tracks score via Zustand and triggers race finish when the player crosses the finish line.",
  "frontend/src/game/sim/useCarPhysics.ts": "Simulates car movement, steering, drifting, and grip using inputs, weather, nitro, and selected car stats.",
  "frontend/src/game/sim/useNitro.ts": "Manages nitro boost state, depletion, regeneration, and boost activation via keyboard input.",
  "frontend/src/game/sim/usePickups.ts": "Generates coin and nitro pickups and handles collision-based scoring and nitro refills.",
  "frontend/src/game/sim/useRaceTimer.ts": "Maintains and updates the race timer each frame unless paused.",
  "frontend/src/game/sim/useRivalAI.ts": "Moves a rival car forward with slight sinusoidal lateral motion.",
  "frontend/src/game/sim/useSpeedometer.ts": "Derives the player's speed in km/h from car physics.",
  "frontend/src/game/sim/weather.ts": "Randomly toggles rain state over time, affecting game physics elsewhere.",
  "frontend/src/game/state/gameState.ts": "Zustand store managing game view, race status, and transitions like start, pause, finish, and restart.",
  "frontend/src/game/ui/ControlsHelp.tsx": "UI component showing a toggleable controls help panel.",
  "frontend/src/game/ui/FinishOverlay.tsx": "Displays end‑of‑race results, high score logic, and actions to restart or return to garage.",
  "frontend/src/game/ui/HUD.tsx": "Shows in‑race HUD including score, high score, position, time, speed, and nitro bar.",
  "frontend/src/game/ui/PauseOverlay.tsx": "Pause screen with options to resume, restart, or return to garage.",
  "frontend/src/game/ui/StartOverlay.tsx": "Start screen prompting the user to begin the race.",
  "frontend/src/hooks/useActor.ts": "Creates and maintains a backend actor tied to user identity and refreshes dependent queries on change.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides React context and provider for Internet Identity, creating AuthClient instances and exposing identity state, login, and logout helpers.",
  "frontend/src/hooks/useQueries.ts": "Defines React Query hooks to load and save the caller's user profile using the actor API and optional Candid normalization.",
  "frontend/src/index.css": "Tailwind base/theme setup defining CSS variables for light/dark modes and custom utilities like text shadows.",
  "frontend/src/main.tsx": "Initializes the React app, wrapping it with React Query and Internet Identity providers.",
  "frontend/src/utils/candidOption.ts": "Utility helpers for converting optional Candid values to/from consistent TypeScript representations, including bigint normalization.",
  "frontend/src/utils/urlParams.ts": "Utilities for reading, persisting, and clearing URL parameters with sessionStorage support and hash-query handling.",
  "frontend/tailwind.config.js": "Tailwind configuration enabling dark mode, custom colors, fonts, animations, and plugin integrations.",
  "project_state.json": "Project metadata describing the Unity-based game prototype, features, issues, and requirement tracking."
}