{
  "kind": "build_request",
  "title": "Fix deployment/runtime error blocking app usage (profile + backend state)",
  "priority": "high",
  "requirements": [
    {
      "id": "REQ-11",
      "text": "Identify the error the user sees after deployment (compile-time or runtime), reproduce it locally, and implement a fix so the app loads and the Garage/Race views are usable without uncaught exceptions.",
      "target": "both",
      "source": {
        "messageIds": [
          "msg-4"
        ],
        "quotes": [
          "There is error fix it"
        ]
      },
      "acceptanceCriteria": [
        "Running the app after deployment does not show a blank screen or uncaught exception overlay in the browser console.",
        "Core navigation/rendering works: the app reaches GarageView or RaceView depending on the current game state.",
        "If an error still occurs, the UI displays an English, user-friendly message explaining what failed and how to recover (e.g., retry, logout/login)."
      ]
    },
    {
      "id": "REQ-12",
      "text": "Fix frontend ↔ backend Candid optional type handling for user profiles so that reading and saving the profile works reliably (including first-time users). Ensure the frontend correctly unwraps optional return values and correctly encodes optional arguments when saving (do not send undefined where Candid expects an opt).",
      "target": "both",
      "source": {
        "messageIds": [
          "msg-4"
        ],
        "quotes": [
          "There is error fix it"
        ]
      },
      "acceptanceCriteria": [
        "Fetching the caller profile succeeds when authenticated and returns a consistent frontend shape (either a concrete profile object or null), without requiring callers to manually interpret Candid opt encodings.",
        "Saving a profile from the Profile Setup modal succeeds without serialization/type errors, and subsequent profile fetch returns the saved profile.",
        "The Profile Setup modal is shown only when the authenticated caller has no profile, and it disappears after successful save (without requiring a hard refresh)."
      ]
    },
    {
      "id": "REQ-13",
      "text": "Fix backend user profile storage implementation to use a correct Motoko map/collection API and ensure writes actually persist in canister state (including across upgrades if applicable). Add a conditional migration only if the stable state layout changes from the currently deployed version.",
      "target": "backend",
      "source": {
        "messageIds": [
          "msg-4"
        ],
        "quotes": [
          "There is error fix it"
        ]
      },
      "acceptanceCriteria": [
        "Backend builds successfully with correct collection usage (no calls to non-existent instance methods on map values).",
        "After calling saveCallerUserProfile or saveHighScore, subsequent reads return the updated values for that caller.",
        "If the persistence mechanism introduces stable variables or changes stable layout, an upgrade does not trap and existing user data (if any) is retained via a conditional migration."
      ]
    },
    {
      "id": "REQ-14",
      "text": "Adjust backend authorization behavior so that first-time authenticated users can initialize their profile without hitting an \"Unauthorized\" trap during the profile read/create flow (while keeping admin-only operations protected).",
      "target": "backend",
      "source": {
        "messageIds": [
          "msg-4"
        ],
        "quotes": [
          "There is error fix it"
        ]
      },
      "acceptanceCriteria": [
        "A newly authenticated user can call the profile read endpoint without the canister trapping on authorization checks (it should return no-profile state that allows onboarding).",
        "A newly authenticated user can successfully create/save a profile immediately after login.",
        "Authorization protections for viewing/updating other users’ profiles remain enforced (non-admin cannot read others)."
      ]
    }
  ],
  "constraints": [
    "Backend must remain a single Motoko actor in backend/main.mo; only add backend/migration.mo if a stable-state upgrade is required by the fix (conditional migration policy).",
    "Do not edit frontend immutable paths: frontend/src/hooks/useInternetIdentity.ts, frontend/src/hooks/useInternetIdentity.tsx, frontend/src/hooks/useActor.ts, frontend/src/main.tsx, frontend/src/components/ui.",
    "Use English for any user-facing text added or changed."
  ],
  "nonGoals": [
    "Adding new gameplay features (cars, tracks, new UI systems) beyond what is necessary to fix the error.",
    "Introducing external databases or third-party authentication providers beyond Internet Identity.",
    "Implementing real-time features (WebSockets/chat) or new backend services."
  ],
  "imageRequirements": {
    "required": [],
    "edits": []
  },
  "userProfileUpdate": {
    "goalsToAdd": [],
    "goalsToRemove": [],
    "preferencesToAdd": [],
    "preferencesToRemove": [],
    "miscToAdd": [],
    "miscToRemove": [],
    "fieldsToSet": {},
    "fieldsToDelete": []
  }
}