{
  "kind": "implementation_plan",
  "version": "1.0",
  "title": "Fix frontend runtime error + robust profile optional handling",
  "requirements": [
    {
      "id": "REQ-11",
      "summary": "Prevent blank screen/uncaught exceptions after deployment and ensure Garage/Race views render with a user-friendly fallback on failure.",
      "acceptanceCriteria": [
        "Running the app after deployment does not show a blank screen or uncaught exception overlay in the browser console.",
        "Core navigation/rendering works: the app reaches GarageView or RaceView depending on the current game state.",
        "If an error still occurs, the UI displays an English, user-friendly message explaining what failed and how to recover (e.g., retry, logout/login)."
      ],
      "file_operations": [
        {
          "path": "frontend/src/components/AppErrorBoundary.tsx",
          "operation": "create",
          "description": "Add a React error boundary that catches render-time errors from the app shell (including GarageView/RaceView) and renders an English recovery UI (retry reload, logout/login guidance)."
        },
        {
          "path": "frontend/src/components/AppFatalErrorScreen.tsx",
          "operation": "create",
          "description": "Add a simple, accessible fatal error screen component used by the error boundary and/or top-level app state to show friendly error text and recovery actions."
        },
        {
          "path": "frontend/src/App.tsx",
          "operation": "modify",
          "description": "Wrap the application content with AppErrorBoundary so render/runtime exceptions do not blank the screen; ensure the app still renders GarageView/RaceView while handling profile-fetch errors gracefully (e.g., show a non-blocking banner/toast + recovery actions). Verify the authorization component's frontend usage instructions before implementing."
        }
      ]
    },
    {
      "id": "REQ-12",
      "summary": "Fix Candid optional handling for user profile read/save so first-time users can fetch null and save without opt/undefined serialization issues; show Profile Setup modal only when needed and dismiss after save.",
      "acceptanceCriteria": [
        "Fetching the caller profile succeeds when authenticated and returns a consistent frontend shape (either a concrete profile object or null), without requiring callers to manually interpret Candid opt encodings.",
        "Saving a profile from the Profile Setup modal succeeds without serialization/type errors, and subsequent profile fetch returns the saved profile.",
        "The Profile Setup modal is shown only when the authenticated caller has no profile, and it disappears after successful save (without requiring a hard refresh)."
      ],
      "file_operations": [
        {
          "path": "frontend/src/utils/candidOption.ts",
          "operation": "create",
          "description": "Add small helpers to normalize/unwrap possible Candid Option encodings on reads and to safely encode optionals on writes (so callers never pass undefined where an opt is expected)."
        },
        {
          "path": "frontend/src/hooks/useQueries.ts",
          "operation": "modify",
          "description": "Normalize getCallerUserProfile results into a stable shape (UserProfile | null), unwrapping any Option-like encodings if returned at runtime; update saveCallerUserProfile mutation to encode optional fields correctly (avoid undefined; encode as proper opt/absence) and update/invalidate the react-query cache so the Profile Setup modal closes immediately after success. Verify the authorization component's frontend usage instructions before implementing."
        },
        {
          "path": "frontend/src/auth/ProfileSetupModal.tsx",
          "operation": "modify",
          "description": "Stop sending `lastSelectedCarIndex: undefined` (omit the field or encode as an explicit opt-none per candidOption helpers); handle save errors with English user-friendly messaging and ensure modal closes after successful save via the updated query cache behavior. Verify the authorization component's frontend usage instructions before implementing."
        },
        {
          "path": "frontend/src/App.tsx",
          "operation": "modify",
          "description": "Tighten the modal gating logic to rely on the normalized profile shape and avoid modal flash; ensure the modal is shown only when authenticated AND profile fetch is resolved AND the profile is null, and remains hidden when fetch fails (show recovery UI instead). Verify the authorization component's frontend usage instructions before implementing."
        }
      ]
    }
  ]
}